Catalogs/гф_УзлыОбменаПоВозвратам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_УзлыОбменаПоВозвратам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяИБНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФайловыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗавершениеОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/гф_УзлыОбменаПоВозвратам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПодключитьсяКБазеОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	вс = Справочники.гф_УзлыОбменаПоВозвратам.НайтиПоРеквизиту("Организация", Организация);
	Если ЗначениеЗаполнено(вс.ЗавершениеОбмена)
		И ТекущаяДата() > КонецДня(вс.ЗавершениеОбмена) Тогда
		
		Возврат Неопределено;	
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(вс) Тогда
		Возврат ПодключитьсяКБазе(вс);
	КонецЕсли;

КонецФункции

Функция ПодключитьсяКБазе(вс) Экспорт
	
	Перем сп;     
	
	УстановитьПривилегированныйРежим(Истина);
	Если вс.ФайловыйРежим Тогда
		
		Если ПустаяСтрока(вс.КаталогИБ) Тогда
			ВызватьИсключение "Не указан каталог ИБ";
		КонецЕсли;
		сп = "File=""" + вс.КаталогИБ + """";	
		
	Иначе		
		
		Если ПустаяСтрока(вс.ИмяСервера) Тогда
			ВызватьИсключение "Не указан сервер ИБ";
		КонецЕсли;
		Если ПустаяСтрока(вс.ИмяИБНаСервере) Тогда
			ВызватьИсключение "Не указано имя ИБ на сервере";
		КонецЕсли;
		сп = "Srvr = """ + вс.ИмяСервера + """; Ref = """ + вс.ИмяИБНаСервере + """";		

	КонецЕсли;
	
		
	Если НЕ ПустаяСтрока(вс.Пользователь) Тогда
		сп = сп + ";Usr = """ + вс.Пользователь + """";
	КонецЕсли;
	Если НЕ ПустаяСтрока(вс.Пароль) Тогда
		сп = сп + ";Pwd = """ + вс.Пароль + """";
	КонецЕсли;
		
	
	сп = сп + ";";
	
	//оп = "V" + вс.ВерсияПлатформы + ".COMConnector";
	оп = "V83.COMConnector";
	
	Подключение = Новый COMОбъект(оп);
	Соединение = Подключение.Connect(сп);
	
	Возврат Соединение;
	
КонецФункции

#КонецЕсли
